
from datetime import datetime, date, time

hh = {0:"ноль часов", 1:"один час", 2:"два часа", 3:"три часа", 
4:"четыре часа", 5:"пять часов", 6:"шесть часов", 7:"семь часов", 
8:"восемь часов", 9:"девять часов", 10:"десять часов", 11:"одиннадцать часов",
12:"двенадцать часов", 13:"один час", 14:"два часа", 15:"три часа", 
16:"четыре часа", 17:"пять часов", 18:"шесть часов", 19:"семь часов", 
20:"восемь часов", 21:"девять часов", 22:"десять часов", 23:"одиннадцать часов", 24:"полночь"}

hh_01_44 = {0:"первого", 1:"второго", 2:"третьего", 3:"четвёртого", 4:"пятого", 5:"шестого", 6:"седьмого",
7:"восьмого", 8:"девятого", 9:"десятого", 10:"одиннадцатого", 11:"двенадцатого", 12:"первого", 
13:"второго", 14:"третьего", 15:"четвёртого", 16:"пятого", 17:"шестого", 18:"седьмого", 19:"восьмого",
20:"девятого", 21:"десятого", 22:"одиннадцатого", 23:"двенадцатого"}

mm_01_59 = {0:"ровно", 1:"одна минута", 2:"две минуты", 3:"три минуты", 4:"четыре минуты", 5:"пять минут", 
6:"шесть минут", 7:"семь минут", 8:"восемь минут", 9:"девять минут", 10:"десять минут", 
11:"одиннадцать минут", 12:"двенадцать минут", 13:"тринадцать минут", 14:"четырнадцать минут", 
15:"пятнадцать минут", 16:"шестнадцать минут", 17:"семнадцать минут", 18:"восемнадцать минут", 
19:"девятнадцать минут", 20:"двадцать минут", 21:"двадцать одна минута", 22:"двадцать две минуты", 
23:"двадцать три минуты", 24:"двадцать четыре минуты", 25:"двадцать пять минут", 26:"двадцать шесть минут",
27:"двадцать семь минут", 28:"двадцать восемь минут", 29:"двадцать девять минут", 30: "половина" , 
31:"тридцать одна минута", 32:"тридцать две минуты", 33:"тридцать три минуты", 
34:"тридцать четыре минуты", 35:"тридцать пять минут", 36:"тридцать шесть минут", 37:"тридцать семь минут",
38:"тридцать восемь минут", 39:"тридцать девять минут", 40:"сорок минут", 41:"сорок одна минута",
42:"сорок две минуты", 43:"сорок три минуты", 44:"сорок четыре минуты", 45:"без пятнадцати минут", 
46:"без четырнадцати минут", 47:"без тринадцати минут",
48:"без двенадцати минут", 49:"без одиннадцати минут", 50:"без десяти минут", 51:"без девяти минут",
52:"без восьми минут", 53:"без семи минут", 54:"без шести минут", 55:"без пяти минут", 56:"без четырех минут",
57:"без трех минут", 58:"без двух минут", 59:"без одной минуты"}

while True:
    i = input('To see the current time input "yes" or you can enter your time value in the format "hh:mm": ') 
    if i.upper() == "YES":
        current_time = datetime.now().time()
        hh_now = current_time.hour
        print(hh_now) 
        print(type(hh_now)) 
        mm_now = int(current_time.strftime("%M"))
        print(mm_now)
        print(type(mm_now))
        if 0<mm_now<30 or 30<mm_now<45:
            print(f'Сейчас {mm_01_59.get(mm_now)} {hh_01_44.get(hh_now)}.') 
        if 45<=mm_now<=59:
            print(f'Сейчас {mm_01_59.get(mm_now)} {hh.get(hh_now+1)}.')
        if mm_now == 0:
            print(f'Сейчас {hh.get(hh_now)} {mm_01_59.get(mm_now)}.')
        if mm_now == 30:
            print(f'Сейчас {mm_01_59.get(mm_now)} {hh_01_44.get(hh_now)}.')
        continue
    
    if i[2] != ':':
        print('Delimiter format is incorrect, use only ":". Please try again.')
        continue
    
    values = i.split(':')
    failed = False
    for value in values:
        if not value.isdigit():
            failed = True
            break          
    if failed:
        print('Use only the number format "23:59".')
        continue
    h_inp = int(values[0])
    m_inp = int(values[1])    
    if h_inp>23 or m_inp>59:
        print('Use numbers no more than "23:59".')
        continue
    else:
        if 0<m_inp<30 or 30<m_inp<45:
            print(f'Введенное время: {mm_01_59.get(m_inp)} {hh_01_44.get(h_inp)}.') 
        if 45<=m_inp<=59:
            print(f'Введенное время: {mm_01_59.get(m_inp)} {hh.get(h_inp+1)}.')
        if m_inp == 0:
            print(f'Введенное время: {hh.get(h_inp)} {mm_01_59.get(m_inp)}.')
        if m_inp == 30:
            print(f'Введенное время: {mm_01_59.get(m_inp)} {hh_01_44.get(h_inp)}.')
        continue