time_selector = { 1 : ["один","одна","первого","одной"], 2 : ["два","две","второго","двух"], 3 : ["три","три","третьего","трех"],
     4 : ["четыре","четыре","четвёртого","четырёх"], 5 : ["пять","пять","пятого","пяти"],6 : ["шесть","шесть","шестого","шести"],
     7 : ["семь","семь","седьмого","семи"], 8 : ["восемь","восемь","восьмого","восьми"], 9 : ["девять","девять","девятого","девяти"],
    10 : ["десять","десять","десятого","десяти"], 11 : ["одиннадцать","одиннадцать","одиннадцатого","одиннадцати"],
     0 : ["двенадцать","двенадцать","двенадцатого"], 12 : ["двенадцать","двенадцать","двенадцатого","двенадцати"], 
    13 : ["тринадцать","тринадцать","","тринадцати"], 14 : ["четырнадцать","четырнадцать","","четырнадцати"], 15 : ["пятнадцать","пятнадцать","","пятнадцати"],
    16 : ["шестнадцать","шестнадцать"], 17 : ["семнадцать","семнадцать"], 18 : ["восемнадцать","восемнадцать"], 19 : ["девятнадцать","девятнадцать"],
    20 : ["двадцать ","двадцать"], 30 : ["тридцать "], 40 : ["сорок "] }
    
clock_words = { "hours" : [ " час ровно", " часа ровно", " часов ровно", "половина "],
               "minits" : [ " минута ", " минуты ", " минут ", "без "] }
               