import datetime

d_minutes = {00:[("ровно"),("часа ровно"),("часов ровно")] , 1:"одна минута",
 2:"две минуты", 3:"три минуты", 4:"четыре минуты", 5:"пять минут",
 6:"шесть минут", 7:"семь минут", 8:"восемь минут", 9:"девять минут",
 10:"десять минут", 11:"одиннадцать минут", 12: "двенадцать минут",
 13:"тринадцать минут", 14:"четырнадцать минут", 15:"пятнадцать минут",
 16:"шестнадцать минут", 17:"семнадцать минут", 18:"восемнадцать минут",
 19:"девятнадцать минут", 20:"двадцать минут", 21:"двадцать одна минута",
 22:"двадцать две минуты", 23:"двадцать три минуты",
 24:"двадцать четыре минуты", 25:"двадцать пять минут", 26:"двадцать шесть минут",
 27:"двадцать семь минут", 28:"двадцать восемь минут", 29:"двадцать девять минут", 
 30:"половина", 31:"тридцать одна минута", 32:"тридцать две минуты",
 33:"тридцать три минуты", 34:"тридцать четыре минуты", 35:"тридцать пять минут",
 36:"тридцать шесть минут", 37:"тридцать семь минут", 38:"тридцать восемь минут",
 39:"тридцать девять минут", 40:"сорок минут", 41:"сорок одна минута",
 42:"сорок две минуты", 43:"сорок три минуты", 44:"сорок четыре минуты",
 45:"без пятнадцати минут", 46:"без четырнадцати минут", 47:"без тринадцати минут",
 48:"без двенадцати минут", 49:"без одиннадцати минут",  50:"без десяти минут",
 51:"без девяти минут", 52:"без восьми минут", 53:"без семи минут",
 54:"без шести минут", 55:"без пяти минут", 56:"без четырех минут",
 57:"без трех минут", 58:"без двух минут", 59:"без одной минуты"} 

d_hours = {00:[("двенадцать"), ("двенадцатoго")], 1:[("час"), ("первого")],
 2:[("два"), ("второго")], 3:[("три"), ("третьего")], 4:[("четыре"), ("четвертого")],
 5:[("пять"), ("пятого")], 6:[("шесть"), ("шестого")], 7:[("семь"), ("седьмого")],
 8:[("восемь"), ("восьмого")], 9:[("девять"), ("девятого")],
 10:[("десять"), ("десятого")], 11:[("одиннадцать"), ("одиннадцатого")],
 12:[("двенадцать"), ("двенадцатого")], 13:[("час"), ("первого")], 
 14:[("два"), ("второго")], 15:[("три"), ("третьего")],
 16:[("четыре"), ("четвертого")], 17:[("пять"), ("пятого")],
 18:[("шесть"), ("шестого")], 19:[("семь"), ("седьмого")],
 20:[("восемь"), ("восьмого")], 21:[("девять"), ("девятого")],
 22:[("десять"), ("десятого")], 23:[("одиннадцать"), ("одиннадцатого")],
 24:[("двенадцать"), ("двенадцатoго")]}

y = datetime.datetime.now()
z = y.time()

while True :
    try :
        c = int(input('To know the current time - enter 1. To enter your time - enter 2:\n'))
        if c == 1 or c == 2 :
            break
        else :
            print('Enter only 1 or 2')
    except ValueError :
        print('Enter only digits 1 or 2')  
              
if c == 1 :
    hours = z.hour
    minutes = z.minute
if c == 2 :
    while True : 
        x = input("Enter the time in the 'hh:mm' format :\n")
            
        if len(x) != 5 :
            print('Try again, incorrect amount of character')
            continue

        a = x.split(':')
        failed = False
        for i in a :
            if not i.isdigit() :
                failed = True
                break
        if failed :
            print('Try again, enter only digits')
            continue

        if x[2] != ':' :
            print('Try again, you miss ":"')
            continue

        hours = int(a[0])
        minutes = int(a[1])
        if hours > 23 :
            print('Incorrect range of hours')
            continue
        if minutes > 59 :
            print('Incorrect range of minutes')
            continue

        break

if minutes >= 45 :
    print(d_minutes[minutes], d_hours[hours + 1][0])
if minutes > 0 and minutes < 45 :
    print(d_minutes[minutes], d_hours[hours + 1][1])
if minutes == 0 :
    if 5 > hours > 1 :
        print(d_hours[hours][0], d_minutes[minutes][1])
if minutes == 0 :
    if 17 > hours > 13 :
        print(d_hours[hours][0], d_minutes[minutes][1])
if minutes == 0 :
    if 13 > hours > 4 :
        print(d_hours[hours][0], d_minutes[minutes][2])
if minutes == 0 :
    if hours > 16 :
        print(d_hours[hours][0], d_minutes[minutes][2]) 
if minutes == 0 :
    if hours == 0 :
        print(d_hours[hours][0], d_minutes[minutes][2]) 
if minutes == 0 :
    if hours == 1 :
        print(d_hours[hours][0], d_minutes[minutes][0])                      
if minutes == 0 :
    if hours == 13 :
        print(d_hours[hours][0], d_minutes[minutes][0])

        